portal-api/app/controllers/api/v1/customers_controller.rb

      def update
        @customer.update!(permitted_params)
---
UPDATE "customers" SET "name" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["name", "Marcos S"], ["updated_at", "2024-07-12 19:14:35.532431"], ["id", 1]]