portal-api/app/controllers/api/v1/customers_controller.rb

      def update
        @customer.update!(permitted_params)
---
UPDATE "customers" SET "uid" = $1, "name" = $2, "email" = $3, "updated_at" = $4 WHERE "customers"."id" = $5  [["uid", "johnupgraded@test.test"], ["name", "John upgraded"], ["email", "johnupgraded@test.test"], ["updated_at", "2024-07-13 14:37:22.843344"], ["id", 102]]